In [1]:
import numpy as np

In [2]:
import pandas as pd

### Numpy is the basis of Pandas. So, we first "shape" our array (spaced 3 rows, 3 columns), with a range up to 9.

In [3]:
data = np.reshape(np.arange(9),(3,3))

In [13]:
data

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

### We then turn that array into a dataframe, where we establish rows and columns.

In [14]:
df1 = pd.DataFrame(data)

In [15]:
df1

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [20]:
df1.columns=["A", "B", "C"]

In [21]:
df1.index=["first", "second", "third"]

In [23]:
df1

        A  B  C
first   0  1  2
second  3  4  5
third   6  7  8

In [24]:
df2 = pd.DataFrame(np.random.rand(3,3))

In [32]:
df2

               D         F         E
first   0.988799  0.400637  0.036485
second  0.688826  0.674449  0.235895
third   0.572365  0.214032  0.450472

In [31]:
df2.columns = ("D", "F", "E")

In [33]:
df2.index = ("first", "second", "third")

In [43]:
df3 = pd.concat([df1,df2], axis = 1)

### Using Pandas concat method and using axis=1 (<mark>axis 1 impacts columns, axis 0 impacts rows</mark>) will join the rows of each dataframe together.

In [39]:
df3

        A  B  C         D         F         E
first   0  1  2  0.988799  0.400637  0.036485
second  3  4  5  0.688826  0.674449  0.235895
third   6  7  8  0.572365  0.214032  0.450472

In [44]:
df3.dtypes

A      int64
B      int64
C      int64
D    float64
F    float64
E    float64
dtype: object

### Calling all colums

In [45]:
df3.columns

Index(['A', 'B', 'C', 'D', 'F', 'E'], dtype='object')

In [46]:
df3["F"]

first     0.400637
second    0.674449
third     0.214032
Name: F, dtype: float64

### .loc will bring back all the values of a row

In [47]:
df3.loc["first"]

A    0.000000
B    1.000000
C    2.000000
D    0.988799
F    0.400637
E    0.036485
Name: first, dtype: float64

### Much like .loc will return values by row, the .iloc method will search by index

In [48]:
df3.iloc[0]

A    0.000000
B    1.000000
C    2.000000
D    0.988799
F    0.400637
E    0.036485
Name: first, dtype: float64

### But to find a certain value, you use indices

In [52]:
df3.iloc[2][2]

8.0